package ErrorsAndExceptions.classes;

public enum Subject {
    ПСИХОЛОГИЯ("Психология"), ФИЛОСОФИЯ ("Философия"), ПОЛИТОЛОГИЯ ("Политология"),
    ЛОГИСТИКА ("Логистика"), МАРКЕТИНГ ("Маркетинг"), СТАТИСТИКА ("Статистика"),
    ОС ("Операционные системы"), ООП ("Объектно-ориентированное программирование"),
    БД ("Базы данных"), ТЕХНОЛОГИЯ_МАТЕРИАЛОВ ("Технология материалов"),
    МАТЕРИАЛОВЕДЕНИЕ("Материаловедение"), ТЕОРИЯ_РЕЗАНИЯ ("Теория резания");

    String realName;

    Subject(String realName) {
        this.realName = realName;
    }

    @Override
    public String toString() {
        return realName;
    }
}
